# Learning Objectives

1. Applying NumPy functions
2. Applying lambda functions
3. Applying regular python functions
4. Mapping a function to a dataframe

In [1]:
import numpy as np
import pandas as pd

In [2]:
scores_data = {"Student": ["Tom", "Katey", "Mak", "Bill", "Tom", "Rahul"],
               "Age": np.random.randint(20, 25, size=6),
               "Sub1_Score": np.random.randint(40, 100, size=6),
               "Sub2_Score": np.random.randint(40, 100, size=6),
               "Sub3_Score": np.random.randint(40, 100, size=6)
              }

scores_df = pd.DataFrame(scores_data)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   23          50          56          70
1   Katey   22          92          78          72
2     Mak   23          79          66          79
3    Bill   21          57          91          75
4     Tom   21          89          83          98
5   Rahul   21          68          80          65

## Applying NumPy functions

In [3]:
mean = np.mean(scores_df['Sub1_Score'])
mean

72.5

In [4]:
np.maximum(scores_df['Sub1_Score'], scores_df['Sub2_Score'])

0    56
1    92
2    79
3    91
4    89
5    80
dtype: int64

## Applying lambda functions

In [5]:
fn = lambda x : 0.8*x
scores_df['Sub1_Score'].apply(fn)

0    40.0
1    73.6
2    63.2
3    45.6
4    71.2
5    54.4
Name: Sub1_Score, dtype: float64

In [6]:
fn = lambda x: x - mean

scores_df[['Sub1_Score', 'Sub2_Score', 'Sub3_Score']].apply(fn)

   Sub1_Score  Sub2_Score  Sub3_Score
0       -22.5       -16.5        -2.5
1        19.5         5.5        -0.5
2         6.5        -6.5         6.5
3       -15.5        18.5         2.5
4        16.5        10.5        25.5
5        -4.5         7.5        -7.5

## Apply regular python functions

In [7]:
def standardise(x):
    return (x - x.mean()) / x.std()

In [8]:
std_df = scores_df.iloc[: , 2:].apply(standardise)
std_df

   Sub1_Score  Sub2_Score  Sub3_Score
0   -1.316037   -1.561306   -0.563410
1    1.140565    0.185240   -0.390053
2    0.380188   -0.767421    0.216696
3   -0.906603    1.217289   -0.130018
4    0.965094    0.582182    1.863586
5   -0.263207    0.344016   -0.996802

## Mapping a function to a dataframe

In [9]:
std_df.applymap(lambda x: '%0.3f'%x)

  Sub1_Score Sub2_Score Sub3_Score
0     -1.316     -1.561     -0.563
1      1.141      0.185     -0.390
2      0.380     -0.767      0.217
3     -0.907      1.217     -0.130
4      0.965      0.582      1.864
5     -0.263      0.344     -0.997

In [10]:
std_df['Sub1_Score'].map(lambda x: '%0.3f'%x)

0    -1.316
1     1.141
2     0.380
3    -0.907
4     0.965
5    -0.263
Name: Sub1_Score, dtype: object

In [11]:
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   23          50          56          70
1   Katey   22          92          78          72
2     Mak   23          79          66          79
3    Bill   21          57          91          75
4     Tom   21          89          83          98
5   Rahul   21          68          80          65

In [13]:
scores_df.columns = scores_df.columns.map(str.lower)

In [14]:
scores_df

  student  age  sub1_score  sub2_score  sub3_score
0     Tom   23          50          56          70
1   Katey   22          92          78          72
2     Mak   23          79          66          79
3    Bill   21          57          91          75
4     Tom   21          89          83          98
5   Rahul   21          68          80          65